# Getting Started With SQL and BigQuery
[Kaggles's Getting Started With SQL and BigQuery](https://www.kaggle.com/dansbecker/getting-started-with-sql-and-bigquery)

[Exercise: Getting Started With SQL and BigQuery](https://www.kaggle.com/aubreyjohn/exercise-getting-started-with-sql-and-bigquery/edit)

**Note:**

Each Kaggle user can scan 5TB every 30 days for free. Once you hit that limit, you'll have to wait for it to reset.

# Select, From & Where
[Kaggles's Select, From & Where](https://www.kaggle.com/dansbecker/select-from-where)

[Exercise: Select, From & Where](https://www.kaggle.com/aubreyjohn/exercise-select-from-where/edit)

# Groupby, having and count
[Kaggles's Groupby, having and count](https://www.kaggle.com/learn/intro-to-sql)

[Exercise: Groupby, having and count](https://www.kaggle.com/aubreyjohn/exercise-group-by-having-count/edit)

# OrderBy
[Kaggles's OrderBy](https://www.kaggle.com/dansbecker/order-by)

[Exercise: OrderBy](https://www.kaggle.com/aubreyjohn/exercise-order-by/edit)

# AS & WITH
[Kaggles's AS & WITH](https://www.kaggle.com/dansbecker/as-with)

[Exercise: AS & WITH](https://www.kaggle.com/aubreyjohn/exercise-as-with/edit)

# Joining Data, LIKE
[Kaggles's Joining Data](https://www.kaggle.com/dansbecker/joining-data)

[Exercise: Joining Data](https://www.kaggle.com/aubreyjohn/exercise-joining-data/edit)

# Joins and Unions
[Kaggles's Joins and Unions](https://www.kaggle.com/alexisbcook/joins-and-unions)

[Exercise: Joins and Unions](https://www.kaggle.com/aubreyjohn/exercise-joins-and-unions/edit)

# Analytic Functions
[Kaggles's Analytic Functions](https://www.kaggle.com/alexisbcook/analytic-functions)

[Exercise: Analytic Functions](https://www.kaggle.com/aubreyjohn/exercise-analytic-functions/edit)

# Nested and Repeated Data
[Kaggles's Nested and Repeated Data](https://www.kaggle.com/alexisbcook/nested-and-repeated-data)

[Exercise: Nested and Repeated Data](https://www.kaggle.com/aubreyjohn/exercise-nested-and-repeated-data/edit)

# Writing Efficient Queries
[Kaggles's Writing Efficient Queries](https://www.kaggle.com/alexisbcook/writing-efficient-queries)

[Exercise: Writing Efficient Queries](https://www.kaggle.com/aubreyjohn/exercise-writing-efficient-queries/edit)

# Connect to MySql Database

In [1]:
import mysql.connector # import the mysql connector
import pandas as pd

In [2]:
db_conn = mysql.connector.connect(
    host="localhost", 
    user="root", 
    passwd="",
    database="employees"
)

if db_conn:    
    print('Success! Database connected successfully') 
else: 
    print("Error! Database not connected")

Success! Database connected successfully

# Show tables in a MySql Database

In [3]:
# show all the tables in our database 
mycursor = db_conn.cursor() 
query_tables = "SHOW TABLES" 
mycursor.execute(query_tables) 
all_tables = mycursor.fetchall() 
all_tables

[('current_dept_emp',),
 ('departments',),
 ('dept_emp',),
 ('dept_emp_latest_date',),
 ('dept_manager',),
 ('employees',),
 ('salaries',),
 ('titles',)]

## View current_dept_emp table

In [7]:
current_dept_emp_df = pd.read_sql_query("SELECT * FROM current_dept_emp", db_conn)
current_dept_emp_df.head()

   emp_no dept_no   from_date     to_date
0   10001    d005  1986-06-26  9999-01-01
1   10002    d007  1996-08-03  9999-01-01
2   10003    d004  1995-12-03  9999-01-01
3   10004    d004  1986-12-01  9999-01-01
4   10005    d003  1989-09-12  9999-01-01

## View departments table

In [10]:
departments_df = pd.read_sql_query("SELECT * FROM departments", db_conn)
departments_df.head()

  dept_no         dept_name
0    d009  Customer Service
1    d005       Development
2    d002           Finance
3    d003   Human Resources
4    d001         Marketing

## View dept_emp table

In [11]:
dept_emp_df = pd.read_sql_query("SELECT * FROM dept_emp", db_conn)
dept_emp_df.head()

   emp_no dept_no   from_date     to_date
0   10001    d005  1986-06-26  9999-01-01
1   10002    d007  1996-08-03  9999-01-01
2   10003    d004  1995-12-03  9999-01-01
3   10004    d004  1986-12-01  9999-01-01
4   10005    d003  1989-09-12  9999-01-01

## View dept_emp_latest_date table

In [12]:
dept_emp_latest_date_df = pd.read_sql_query("SELECT * FROM dept_emp_latest_date", db_conn)
dept_emp_latest_date_df.head()

   emp_no   from_date     to_date
0   10001  1986-06-26  9999-01-01
1   10002  1996-08-03  9999-01-01
2   10003  1995-12-03  9999-01-01
3   10004  1986-12-01  9999-01-01
4   10005  1989-09-12  9999-01-01

## View dept_manager table

In [14]:
dept_manager_df = pd.read_sql_query("SELECT * FROM dept_manager", db_conn)
dept_manager_df.head()

   emp_no dept_no   from_date     to_date
0  110022    d001  1985-01-01  1991-10-01
1  110039    d001  1991-10-01  9999-01-01
2  110085    d002  1985-01-01  1989-12-17
3  110114    d002  1989-12-17  9999-01-01
4  110183    d003  1985-01-01  1992-03-21

## View employees table

In [8]:
employees_df = pd.read_sql_query("SELECT * FROM employees", db_conn)
employees_df.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [9]:
salaries_df = pd.read_sql_query("SELECT * FROM salaries", db_conn)
salaries_df.head()

   emp_no  salary   from_date     to_date
0   10001   60117  1986-06-26  1987-06-26
1   10001   62102  1987-06-26  1988-06-25
2   10001   66074  1988-06-25  1989-06-25
3   10001   66596  1989-06-25  1990-06-25
4   10001   66961  1990-06-25  1991-06-25

In [15]:
titles_df = pd.read_sql_query("SELECT * FROM titles", db_conn)
titles_df.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01